-- 分享类型一共有3种。
-- 1计算时间，按照配置，时间短的时候分享
-- 2计算登陆日期，连续登录的时候分享
-- 3通过第一关时分享

SHARE_TYPE_TIME 	= "SHARE_TYPE_TIME"
SHARE_TYPE_DATE 	= "SHARE_TYPE_DATE"
SHARE_TYPE_FIRST_LEVEL 	= "SHARE_TYPE_FIRST_LEVEL"

local ShareConfig = {}

ShareConfig.score = {
	[1] = 90,
	[2] = 80,
	[3] = 70,
	[4] = 60,
}

ShareConfig.finishGuideTitle = {
	[1] = '我开用贝贝玩单词，期待更好的自己！',
	[2] = '我在贝贝开启了一段冒险，一起来吧！',
}

ShareConfig.dateTitle = {
	[1] = '单词虐我千百遍，玩了贝贝如初恋！',
	[2] = '好好划词，天天贝贝！——毛爷爷',
}
	-- [3] = '累计用贝贝hold住%s个单词，what are you弄啥嘞？',
	-- [4] = '累计用贝贝hold住%s个单词，这才是学霸该有的风范！',
	-- [5] = '累计用贝贝hold住%s个单词，这酸爽，你值得拥有！',
	-- [6] = '累计用贝贝hold住%s个单词，不枉我一生不羁爱自习！',
	-- [7] = '累计用贝贝hold住%s个单词，隔壁班如花欣慰地笑了！',
	-- [8] = '累计用贝贝hold住%s个单词，基友们别羞射，夸我吧！',
	-- [9] = '累计用贝贝hold住%s个单词，胸前的红领巾更鲜艳了！',
ShareConfig.normalTitle = {
	[1] = '我在贝贝玩坏了%s小弱，不服来战！',
}
	-- [2] = '我在贝贝单词击败%s的小弱后，习大大非要提拔我！',
	-- [3] = '我在贝贝单词击败%s的小弱后，TFBOYS哭求我签名！',
	-- [4] = '我在贝贝单词击败%s的小弱后，据说惊动了党中央！',
	-- [5] = '我在贝贝单词击败%s的小弱后，鹿晗非约吃饭，好烦！',
	-- [6] = '我在贝贝单词击败%s的小弱后，马云扬言要重金收买我！',
	-- [7] = '我在贝贝单词击败%s的小弱后，吴亦凡来电话还接不接？',
	-- [8] = '我在贝贝单词击败%s的小弱后，郭敬明妄图跟我套近乎！',
	-- [9] = '我在贝贝单词击败%s的小弱后，汪峰的头条梦破灭了！',
	-- [10] = '我在贝贝单词击败%s的小弱后，惨遭Angelababy壁咚！',

return ShareConfig