-- 分享类型一共有3种。
-- 1计算时间，按照配置，时间短的时候分享
-- 2计算登陆日期，连续登录的时候分享
-- 3通过第一关时分享

SHARE_TYPE_TIME 	= "SHARE_TYPE_TIME"
SHARE_TYPE_DATE 	= "SHARE_TYPE_DATE"
SHARE_TYPE_FIRST_LEVEL 	= "SHARE_TYPE_FIRST_LEVEL"

local ShareConfig = {}

ShareConfig.score = {
	[1] = 90,
	[2] = 80,
	[3] = 70,
	[4] = 60,
}

ShareConfig.finishGuideTitle = {
	[1] = '神马？你以为我在玩游戏？其实我在背单词！不信戳！',
	[2] = '推荐一款背单词神器，玩着就把单词背了！不信戳！！',
}

ShareConfig.dateTitle = {
	[1] = '累计用贝贝hold住了%s个单词，期许一个更好的自己！',
	[2] = '累计用贝贝hold住了%s个单词，不忘初心，方得始终！',
	[3] = '累计用贝贝hold住%s个单词，what are you弄啥嘞？',
	[4] = '累计用贝贝hold住%s个单词，这才是学霸该有的风范！',
	[5] = '累计用贝贝hold住%s个单词，这酸爽，你值得拥有！',
	[6] = '累计用贝贝hold住%s个单词，不枉我一生不羁爱自习！',
	[7] = '累计用贝贝hold住%s个单词，隔壁班如花欣慰地笑了！',
	[8] = '累计用贝贝hold住%s个单词，基友们别羞射，夸我吧！',
	[9] = '累计用贝贝hold住%s个单词，胸前的红领巾更鲜艳了！',
}

ShareConfig.normalTitle = {
	[1] = '我在贝贝单词击败%s的小弱后，李易峰追我三条街！',
	[2] = '我在贝贝单词击败%s的小弱后，习大大非要提拔我！',
	[3] = '我在贝贝单词击败%s的小弱后，TFBOYS哭求我签名！',
	[4] = '我在贝贝单词击败%s的小弱后，据说惊动了党中央！',
	[5] = '我在贝贝单词击败%s的小弱后，鹿晗非约吃饭，好烦！',
	[6] = '我在贝贝单词击败%s的小弱后，马云扬言要重金收买我！',
	[7] = '我在贝贝单词击败%s的小弱后，吴亦凡来电话还接不接？',
	[8] = '我在贝贝单词击败%s的小弱后，郭敬明妄图跟我套近乎！',
	[9] = '我在贝贝单词击败%s的小弱后，汪峰的头条梦破灭了！',
	[10] = '我在贝贝单词击败%s的小弱后，惨遭Angelababy壁咚！',
}


return ShareConfig